class EcLogisticTemplateItem < ActiveRecord::Base
  acts_as_taggable
  acts_as_taggable_on :cities

  attr_accessor :cities_str, :provinces_str

  belongs_to :ec_logistic_template

  store :meta, accessors: [ :first_unit, :first_unit_freight, :add_unit, :add_unit_freight, :single_order_amount, :single_order_amount_freight ], coder: JSON
  before_save :set_cities, :add_city_lists

  def add_city_lists
    self.city_list = cities_str unless cities_str.blank?
  end

  def set_cities
    return unless self.provinces_str.present?
    areas={
        "北京" => [["北京",1]],
        "天津" => [["天津",2]],
        "河北" => [["石家庄",3],["唐山",4],["秦皇岛",5],["邯郸",6],["邢台",7],["保定",8],["张家口",9],["承德",10],["沧州",11],["廊坊",12],["衡水",13]],
        "山西" => [["太原",14],["大同",15],["阳泉",16],["长治",17],["晋城",18],["朔州",19],["晋中",20],["运城",21],["忻州",22],["临汾",23],["吕梁",24]],
        "内蒙古" => [["呼和浩特",25],["包头",26],["乌海",27],["赤峰",28],["通辽",29],["鄂尔多斯",30],["呼伦贝尔",31],["巴彦淖尔",32],["乌兰察布",33],["兴安盟",34],["锡林郭勒盟",35],["阿拉善盟",36]],
        "辽宁" =>[["沈阳",37],["大连",38],["鞍山",39],["抚顺",40],["本溪",41],["丹东",42],["锦州",43],["营口",44],["阜新",45],["辽阳",46],["盘锦",47],["铁岭",48],["朝阳",49],["葫芦岛",50]],
        "吉林" => [["长春",51],["吉林",52],["四平",53],["辽源",54],["通化",55],["白山",56],["松原",57],["白城",58],["延边朝鲜族自治州",59]],
        "黑龙江" => [["哈尔滨",60],["齐齐哈尔",61],["鸡西",62],["鹤岗",63],["双鸭山",64],["大庆",65],["伊春",66],["佳木斯",67],["七台河",68],["牡丹江",69],["黑河",70],["绥化",71],["大兴安岭地区",72]],
        "上海" => [["上海",73]],
        "江苏" => [["南京",74],["无锡",75],["徐州",76],["常州",77],["苏州",78],["南通",79],["连云港",80],["淮安",81],["盐城",82],["扬州",83],["镇江",84],["泰州",85],["宿迁",86]],
        "浙江" => [["杭州",87],["宁波",88],["温州",89],["嘉兴",90],["湖州",91],["绍兴",92],["金华",93],["衢州",94],["舟山",95],["台州",96],["丽水",97]],
        "安徽" => [["合肥",98],["芜湖",99],["蚌埠",100],["淮南",101],["马鞍山",102],["淮北",103],["铜陵",104],["安庆",105],["黄山",106],["滁州",107],["阜阳",108],["宿州",109],["巢湖",110],["六安",111],["亳州",112],["池州",113],["宣城",114]],
        "福建" => [["福州",115],["厦门",116],["莆田",117],["三明",118],["泉州",119],["漳州",120],["南平",121],["龙岩",122],["宁德",123]],
        "江西" => [["南昌",124],["景德镇",125],["萍乡",126],["九江",127],["新余",128],["鹰潭",129],["赣州",130],["吉安",131],["宜春",132],["抚州",133],["上饶",134]],
        "山东" => [["济南",135],["青岛",136],["淄博",137],["枣庄",138],["东营",139],["烟台",140],["潍坊",141],["威海",142],["济宁",143],["泰安",144],["日照",145],["莱芜",146],["临沂",147],["德州",148],["聊城",149],["滨州",150],["菏泽",151]],
        "河南" => [["郑州",152],["开封",153],["洛阳",154],["平顶山",155],["焦作",156],["鹤壁",157],["新乡",158],["安阳",159],["濮阳",160],["许昌",161],["漯河",162],["三门峡",163],["南阳",164],["商丘",165],["信阳",166],["周口",167],["驻马店",168]],
        "湖北" => [["武汉",169],["黄石",170],["襄樊",171],["十堰",172],["荆州",173],["宜昌",174],["荆门",175],["鄂州",176],["孝感",177],["黄冈",178],["咸宁",179],["随州",180],["恩施土家族苗族自治州",181], ["仙桃", ""], ["天门", ""], ["潜江", ""], ["神农架林区", ""]],
        "湖南" => [["长沙",182],["株洲",183],["湘潭",184],["衡阳",185],["邵阳",186],["岳阳",187],["常德",188],["张家界",189],["益阳",190],["郴州",191],["永州",192],["怀化",193],["娄底",194],["湘西土家族苗族自治州",195]],
        "广东" => [["广州",196],["深圳",197],["珠海",198],["汕头",199],["韶关",200],["佛山",201],["江门",202],["湛江",203],["茂名",204],["肇庆",205],["惠州",206],["梅州",207],["汕尾",208],["河源",209],["阳江",210],["清远",211],["东莞",212],["中山",213],["潮州",214],["揭阳",215],["云浮",216]],
        "广西" => [["南宁",217],["柳州",218],["桂林",219],["梧州",220],["北海",221],["防城港",222],["钦州",223],["贵港",224],["玉林",225],["百色",226],["贺州",227],["河池",228],["来宾",229],["崇左",230]],
        "海南" => [["海口",231],["三亚",232]],
        "重庆" => [["重庆",233]],
        "四川" => [["成都",234],["自贡",235],["攀枝花",236],["泸州",237],["德阳",238],["绵阳",239],["广元",240],["遂宁",241],["内江",242],["乐山",243],["南充",244],["宜宾",245],["广安",246],["达州",247],["眉山",248],["雅安",249],["巴中",250],["资阳",251],["阿坝藏族羌族自治州",252],["甘孜藏族自治州",253],["凉山彝族自治州县",254]],
        "贵州" => [["贵阳",255],["六盘水",256],["遵义",257],["安顺",258],["铜仁地区",259],["毕节地区",260],["黔西南布依族苗族自治州",261],["黔东南苗族侗族自治州",262],["黔南布依族苗族自治州",263]],
        "云南" => [["昆明",264],["曲靖",265],["玉溪",266],["保山",267],["昭通",268],["丽江",269],["普洱",270],["临沧",271],["文山壮族苗族自治州",272],["红河哈尼族彝族自治州",273],["西双版纳傣族自治州",274],["楚雄彝族自治州",275],["大理白族自治州",276],["德宏傣族景颇族自治州",277],["怒江僳僳族自治州",278],["迪庆藏族自治州",279]],
        "西藏" => [["拉萨",280],["昌都地区",281],["山南地区",282],["日喀则地区",283],["那曲地区",284],["阿里地区",285],["林芝地区",286]],
        "陕西" => [["西安",287],["铜川",288],["宝鸡",289],["咸阳",290],["渭南",291],["延安",292],["汉中",293],["榆林",294],["安康",295],["商洛",296]],
        "甘肃" => [["兰州",297],["嘉峪关",298],["金昌",299],["白银",300],["天水",301],["武威",302],["张掖",303],["平凉",304],["酒泉",305],["庆阳",306],["定西",307],["陇南",308],["临夏回族自治州",309],["甘南藏族自治州",310]],
        "青海" => [["西宁",311],["海东地区",312],["海北藏族自治州",313],["黄南藏族自治州",314],["海南藏族自治州",315],["果洛藏族自治州",316],["玉树藏族自治州",317],["海西蒙古族藏族自治州",318]],
        "宁夏" => [["银川",319],["石嘴山",320],["吴忠",321],["固原",322],["中卫",323]],
        "新疆" => [["乌鲁木齐",324],["克拉玛依",325],["吐鲁番地区",326],["哈密地区",327],["和田地区",328],["阿克苏地区",329],["喀什地区",330],["克孜勒苏柯尔克孜自治州",331],["巴音郭楞蒙古自治州",332],["昌吉回族自治州",333],["博尔塔拉蒙古自治州",334],["伊犁哈萨克自治州",335],["塔城地区",336],["阿勒泰地区",337], ["石河子", ""], ["阿拉尔", ""], ["五家渠", ""], ["图木舒克", ""]],
        "香港" => [["香港",338]],
        "澳门" => [["澳门",339]],
        "台湾" => [["台湾",340]]
    }
    arr = []
    provinces_str.to_s.split(',').each do |province|
      arr << areas[province].to_a.collect(&:first).flatten.compact
    end
    self.cities_str = arr.flatten.join(',')
  end

  def to_weight_calculate_freight(total_weight, province, city)
    if city_list.include?(city) || city_list.include?('全国')
      if (total_weight <= first_unit.to_f) || add_unit.to_f == 0.0
        first_unit_freight.to_f
      else
        (first_unit_freight.to_f + ((total_weight - first_unit.to_f) / add_unit.to_f).ceil * add_unit_freight.to_f)
      end
    else
      nil
    end
  end

end
